In [1]:
# Intro to Numpy
import numpy as np


my_list = [1,2,3,4,5]

my_other_list = [6,7,8,9,10]


# concatenate lists
my_list + my_other_list # this is not what we want, we want to add the element of the lists together

# for i in range(len(my_list)):
#     print(my_list[i] + my_other_list[i])

# convert lists to numpy arrays
my_array = np.array(my_list)
my_other_array = np.array(my_other_list)

print(type(my_array))
print(type(my_other_array))

print(my_array + my_other_array)

<class 'numpy.ndarray'>
<class 'numpy.ndarray'>
[ 7  9 11 13 15]

In [2]:

# Introduction to Pandas

# has 2 datatypes: Series and DataFrames

import pandas as pd

# Series are 1D arrays with labels(indexes)
my_series = pd.Series(my_list)
my_series2 = pd.Series(my_other_list)
print(type(my_series))
print(type(my_series2))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [3]:
my_series.index

RangeIndex(start=0, stop=5, step=1)

In [4]:
my_series.index = ['alan', 'bob', 'charlie', 'david', 'edward']

my_series

alan       1
bob        2
charlie    3
david      4
edward     5
dtype: int64

In [5]:
print(my_series['alan'])

1

In [6]:
# create a series from a list

my_series3 = pd.Series([1,2,3,4,5], index = ['alan', 'bob', 'charlie', 'david', 'edward'])

my_series3.values

array([1, 2, 3, 4, 5], dtype=int64)

In [7]:
print(my_series3[my_series3 > 3])

david     4
edward    5
dtype: int64

In [8]:
print(my_series3[0])

1

In [9]:
my_series3>3

alan       False
bob        False
charlie    False
david       True
edward      True
dtype: bool

In [10]:
my_series3[my_series3>3]

david     4
edward    5
dtype: int64

In [11]:
import this

The Zen of Python, by Tim Peters

Beautiful is better than ugly.
Explicit is better than implicit.
Simple is better than complex.
Complex is better than complicated.
Flat is better than nested.
Sparse is better than dense.
Readability counts.
Special cases aren't special enough to break the rules.
Although practicality beats purity.
Errors should never pass silently.
Unless explicitly silenced.
In the face of ambiguity, refuse the temptation to guess.
There should be one-- and preferably only one --obvious way to do it.
Although that way may not be obvious at first unless you're Dutch.
Now is better than never.
Although never is often better than *right* now.
If the implementation is hard to explain, it's a bad idea.
If the implementation is easy to explain, it may be a good idea.
Namespaces are one honking great idea -- let's do more of those!

In [12]:
import pandas as pd

my_series3 = pd.Series([10,20,30,40,50], index = ['Alan', 'Bob', 'Charlie', 'David', 'Edward'])

In [13]:
Sales_dict = my_series3.to_dict()
Sales_dict

{'Alan': 10, 'Bob': 20, 'Charlie': 30, 'David': 40, 'Edward': 50}

In [14]:
new_sales = pd.Series(my_series3, index=['Alan', 'Bob', 'Charlie', 'David', 'Edward', 'Frank', 'George'])
new_sales
# Case Sensitive indexes

Alan       10.0
Bob        20.0
Charlie    30.0
David      40.0
Edward     50.0
Frank       NaN
George      NaN
dtype: float64

In [15]:
# Find missing values

np.isnan(new_sales)

Alan       False
Bob        False
Charlie    False
David      False
Edward     False
Frank       True
George      True
dtype: bool

In [16]:
# which data is missing for each salesperson
new_sales[np.isnan(new_sales)]

Frank    NaN
George   NaN
dtype: float64

In [17]:
# which data that is complete for each salesperson
new_sales[~np.isnan(new_sales)]

Alan       10.0
Bob        20.0
Charlie    30.0
David      40.0
Edward     50.0
dtype: float64

In [18]:
# Prefered method to find missing values
pd.isna(new_sales)

Alan       False
Bob        False
Charlie    False
David      False
Edward     False
Frank       True
George      True
dtype: bool

In [19]:
# will be deprecated
pd.isnull(new_sales)

Alan       False
Bob        False
Charlie    False
David      False
Edward     False
Frank       True
George      True
dtype: bool

In [20]:
new_sales[pd.isna(new_sales)]

Frank    NaN
George   NaN
dtype: float64

In [21]:
new_sales[pd.notna(new_sales)]

Alan       10.0
Bob        20.0
Charlie    30.0
David      40.0
Edward     50.0
dtype: float64

In [22]:
# Creating a dataframe

new_dict = {'Name':['Tom','Jane','Steve','Lucy'],
        'Sales':[250,500,350,400],
        'Date': [2022,2020,2021,2022]}

df = pd.DataFrame(new_dict)
df

    Name  Sales  Date
0    Tom    250  2022
1   Jane    500  2020
2  Steve    350  2021
3   Lucy    400  2022

In [23]:
print(type(df.values))

<class 'numpy.ndarray'>

In [24]:
print(type(df.index))

<class 'pandas.core.indexes.range.RangeIndex'>

In [25]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [26]:
print(type(df['Name']))

<class 'pandas.core.series.Series'>

In [27]:
print(type(df['Name'][0]))

<class 'str'>

In [28]:
df_index = pd.DataFrame(df, index=['rank 1','Rank 2','Rank 3','Rank 4' ,'Rank 5'])

In [29]:
df_index.index.name='Rank'

In [30]:
df_index

       Name  Sales  Date
Rank
rank 1  NaN    NaN   NaN
Rank 2  NaN    NaN   NaN
Rank 3  NaN    NaN   NaN
Rank 4  NaN    NaN   NaN
Rank 5  NaN    NaN   NaN

In [31]:
df_index.columns

Index(['Name', 'Sales', 'Date'], dtype='object')

In [32]:
df_index.index

Index(['rank 1', 'Rank 2', 'Rank 3', 'Rank 4', 'Rank 5'], dtype='object', name='Rank')

In [33]:
df.values

array([['Tom', 250, 2022],
       ['Jane', 500, 2020],
       ['Steve', 350, 2021],
       ['Lucy', 400, 2022]], dtype=object)

In [34]:
new_dict_v2 = {'Name':['Tom','Jane','Steve','Lucy'],
        'Sales':[250,500,350,400],
        'Date': [2022,2020,2021,2022],
        'Expenses': [100,200,150,200],
        'Rank': ['Rank 1','Rank 2','Rank 2','Rank 4']}

df_v2 = pd.DataFrame(new_dict_v2)

df_v2

    Name  Sales  Date  Expenses    Rank
0    Tom    250  2022       100  Rank 1
1   Jane    500  2020       200  Rank 2
2  Steve    350  2021       150  Rank 2
3   Lucy    400  2022       200  Rank 4

In [35]:

# Choose column to become index and save it
df_v2.set_index('Rank', inplace = True)

In [36]:
# Reset all indexes
df_v2.reset_index(inplace=True)

df_v2

     Rank   Name  Sales  Date  Expenses
0  Rank 1    Tom    250  2022       100
1  Rank 2   Jane    500  2020       200
2  Rank 2  Steve    350  2021       150
3  Rank 4   Lucy    400  2022       200

In [37]:
df_v2.set_index('Rank', inplace=True)

In [38]:
df_v2

         Name  Sales  Date  Expenses
Rank
Rank 1    Tom    250  2022       100
Rank 2   Jane    500  2020       200
Rank 2  Steve    350  2021       150
Rank 4   Lucy    400  2022       200

In [40]:
# square brackets
# outputs a pandas series
df_v2['Name']

Rank
Rank 1      Tom
Rank 2     Jane
Rank 2    Steve
Rank 4     Lucy
Name: Name, dtype: object

In [41]:
# outputs as a pandas datafram
df_v2[['Name']]

         Name
Rank
Rank 1    Tom
Rank 2   Jane
Rank 2  Steve
Rank 4   Lucy

In [50]:
df_v2 = df_v2[['Name', 'Sales', 'Date']]
df_v2

         Name  Sales  Date
Rank
Rank 1    Tom    250  2022
Rank 2   Jane    500  2020
Rank 2  Steve    350  2021
Rank 4   Lucy    400  2022

In [52]:
# slicing example, [<begin>:<end>] ----- end not included, starting from zero
df_v2[1:3]

         Name  Sales  Date
Rank
Rank 2   Jane    500  2020
Rank 2  Steve    350  2021

In [53]:
# query df_v2 for Date > 2020
df_v2[df_v2['Date'] > 2020]

         Name  Sales  Date
Rank
Rank 1    Tom    250  2022
Rank 2  Steve    350  2021
Rank 4   Lucy    400  2022

In [54]:
# query df_v2 for Date > 2020
df_v2[~df_v2['Date'] > 2020]

Empty DataFrame
Columns: [Name, Sales, Date]
Index: []

In [55]:
df_v2

         Name  Sales  Date
Rank
Rank 1    Tom    250  2022
Rank 2   Jane    500  2020
Rank 2  Steve    350  2021
Rank 4   Lucy    400  2022

In [61]:
# show sales greater than 200 and Sales greater than 300
df_v2[(df_v2['Date'] > 2020) & (df_v2['Sales'] > 300)]

         Name  Sales  Date
Rank
Rank 2  Steve    350  2021
Rank 4   Lucy    400  2022

In [62]:
# pandas isin function
# Return records where name is Tom or Steve
df_v2[df_v2['Name'].isin(['Tom', 'Steve'])]

         Name  Sales  Date
Rank
Rank 1    Tom    250  2022
Rank 2  Steve    350  2021

In [63]:
# show records for the date 2020 and 2022 RECOOMENDED
df_v2[df_v2['Date'].isin([2020, 2022])]

        Name  Sales  Date
Rank
Rank 1   Tom    250  2022
Rank 2  Jane    500  2020
Rank 4  Lucy    400  2022

In [68]:
# Alternate way NOT RECOMMENDED
# Return all records for 2020 and 2022
df_v2[(df_v2['Date'] == 2020 )| (df_v2['Date'] == 2022)]

        Name  Sales  Date
Rank
Rank 1   Tom    250  2022
Rank 2  Jane    500  2020
Rank 4  Lucy    400  2022

In [ ]:
# loc and iloc

# loc is used to access a group of rows and columns by label(s) or a boolean array
# iloc is used to access a group of rows and columns by integer location(s)

In [74]:
# loc example
# Return only name and sales for rank 1 to rank 3 with 3 not included
df_v2.loc['Rank 1':'Rank 3',[ 'Name', 'Sales']]

         Name  Sales
Rank
Rank 1    Tom    250
Rank 2   Jane    500
Rank 2  Steve    350

In [77]:
# loc example number 2
# return only the name and sales for the records with date 2020 and 2022
df_v2.loc[df_v2['Date'].isin([2020, 2022]), ['Name', 'Sales']]

        Name  Sales
Rank
Rank 1   Tom    250
Rank 2  Jane    500
Rank 4  Lucy    400

In [78]:
# iloc example
# return only the name and sales for the records with date 2020 and 2022
df_v2.iloc[[0,3], [0,1]]

        Name  Sales
Rank
Rank 1   Tom    250
Rank 4  Lucy    400

In [79]:
df_v2

         Name  Sales  Date
Rank
Rank 1    Tom    250  2022
Rank 2   Jane    500  2020
Rank 2  Steve    350  2021
Rank 4   Lucy    400  2022

In [82]:
# return a slice in the rows
df_v2.iloc[0:3]

# df_v2.iloc[:3] # returns from the beginning to the 3 record not including 3

# df_v2.iloc[3:] # returns from the 3 record to the end

df_v2.iloc[0:3]

         Name  Sales  Date
Rank
Rank 1    Tom    250  2022
Rank 2   Jane    500  2020
Rank 2  Steve    350  2021

In [84]:
# creating dictionaries
keys = ['a', 'b', 'c']
values = [1, 2, 3]
dictionary = dict(zip(keys, values))
print(dictionary) # {'a': 1, 'b': 2, 'c': 3}

{'a': 1, 'b': 2, 'c': 3}

In [89]:
df = pd.read_csv("gapminder.csv")

In [92]:
df.head()

   Unnamed: 0      country  year  population      cont  life_exp       gdp_cap
0          11  Afghanistan  2007  31889923.0      Asia    43.828    974.580338
1          23      Albania  2007   3600523.0    Europe    76.423   5937.029526
2          35      Algeria  2007  33333216.0    Africa    72.301   6223.367465
3          47       Angola  2007  12420476.0    Africa    42.731   4797.231267
4          59    Argentina  2007  40301927.0  Americas    75.320  12779.379640

In [93]:
df.tail()

,Unnamed: 0,country,year,population,cont,life_exp,gdp_cap
137,1655,Vietnam,2007,85262356.0,Asia,74.249,2441.576404
138,1667,West Bank and Gaza,2007,4018332.0,Asia,73.422,3025.349798
139,1679,"Yemen, Rep.",2007,22211743.0,Asia,62.698,2280.769906
140,1691,Zambia,2007,11746035.0,Africa,42.384,1271.211593
141,1703,Zimbabwe,2007,12311143.0,Africa,43.487,469.709298

In [90]:
print(df.info)

<bound method DataFrame.info of      Unnamed: 0             country  year  population      cont  life_exp
0            11         Afghanistan  2007  31889923.0      Asia    43.828  \
1            23             Albania  2007   3600523.0    Europe    76.423
2            35             Algeria  2007  33333216.0    Africa    72.301
3            47              Angola  2007  12420476.0    Africa    42.731
4            59           Argentina  2007  40301927.0  Americas    75.320
..          ...                 ...   ...         ...       ...       ...
137        1655             Vietnam  2007  85262356.0      Asia    74.249
138        1667  West Bank and Gaza  2007   4018332.0      Asia    73.422
139        1679         Yemen, Rep.  2007  22211743.0      Asia    62.698
140        1691              Zambia  2007  11746035.0    Africa    42.384
141        1703            Zimbabwe  2007  12311143.0    Africa    43.487

          gdp_cap
0      974.580338
1     5937.029526
2     6223.367465
3     4797.231267
4    12779.379640
..            ...
137   2441.576404
138   3025.349798
139   2280.769906
140   1271.211593
141    469.709298

[142 rows x 7 columns]>

In [91]:
df.describe()

        Unnamed: 0    year    population    life_exp       gdp_cap
count   142.000000   142.0  1.420000e+02  142.000000    142.000000
mean    857.000000  2007.0  4.402122e+07   67.007423  11680.071820
std     493.631441     0.0  1.476214e+08   12.073021  12859.937337
min      11.000000  2007.0  1.995790e+05   39.613000    277.551859
25%     434.000000  2007.0  4.508034e+06   57.160250   1624.842248
50%     857.000000  2007.0  1.051753e+07   71.935500   6124.371108
75%    1280.000000  2007.0  3.121004e+07   76.413250  18008.835640
max    1703.000000  2007.0  1.318683e+09   82.603000  49357.190170

In [94]:
df.head(10)

,Unnamed: 0,country,year,population,cont,life_exp,gdp_cap
0,11,Afghanistan,2007,31889923.0,Asia,43.828,974.580338
1,23,Albania,2007,3600523.0,Europe,76.423,5937.029526
2,35,Algeria,2007,33333216.0,Africa,72.301,6223.367465
3,47,Angola,2007,12420476.0,Africa,42.731,4797.231267
4,59,Argentina,2007,40301927.0,Americas,75.320,12779.379640
5,71,Australia,2007,20434176.0,Oceania,81.235,34435.367440
6,83,Austria,2007,8199783.0,Europe,79.829,36126.492700
7,95,Bahrain,2007,708573.0,Asia,75.635,29796.048340
8,107,Bangladesh,2007,150448339.0,Asia,64.062,1391.253792
9,119,Belgium,2007,10392226.0,Europe,79.441,33692.605080

In [97]:
# grouby continentet 
# creates a groupby object that can be iterated over
df_cont_wise = df.groupby('cont')

In [98]:
print(df_cont_wise)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001FC19154430>

In [99]:
for i in df_cont_wise:
    print(i)

('Africa',      Unnamed: 0                   country  year   population    cont
2            35                   Algeria  2007   33333216.0  Africa  \
3            47                    Angola  2007   12420476.0  Africa
10          131                     Benin  2007    8078314.0  Africa
13          167                  Botswana  2007    1639131.0  Africa
16          203              Burkina Faso  2007   14326203.0  Africa
17          215                   Burundi  2007    8390505.0  Africa
19          239                  Cameroon  2007   17696293.0  Africa
21          263  Central African Republic  2007    4369038.0  Africa
22          275                      Chad  2007   10238807.0  Africa
26          323                   Comoros  2007     710960.0  Africa
27          335          Congo, Dem. Rep.  2007   64606759.0  Africa
28          347               Congo, Rep.  2007    3800610.0  Africa
30          371             Cote d'Ivoire  2007   18013409.0  Africa
35          431                  Djibouti  2007     496374.0  Africa
38          467                     Egypt  2007   80264543.0  Africa
40          491         Equatorial Guinea  2007     551201.0  Africa
41          503                   Eritrea  2007    4906585.0  Africa
42          515                  Ethiopia  2007   76511887.0  Africa
45          551                     Gabon  2007    1454867.0  Africa
46          563                    Gambia  2007    1688359.0  Africa
48          587                     Ghana  2007   22873338.0  Africa
51          623                    Guinea  2007    9947814.0  Africa
52          635             Guinea-Bissau  2007    1472041.0  Africa
68          827                     Kenya  2007   35610177.0  Africa
73          887                   Lesotho  2007    2012649.0  Africa
74          899                   Liberia  2007    3193942.0  Africa
75          911                     Libya  2007    6036914.0  Africa
76          923                Madagascar  2007   19167654.0  Africa
77          935                    Malawi  2007   13327079.0  Africa
79          959                      Mali  2007   12031795.0  Africa
80          971                Mauritania  2007    3270065.0  Africa
81          983                 Mauritius  2007    1250882.0  Africa
85         1031                   Morocco  2007   33757175.0  Africa
86         1043                Mozambique  2007   19951656.0  Africa
88         1067                   Namibia  2007    2055080.0  Africa
93         1127                     Niger  2007   12894865.0  Africa
94         1139                   Nigeria  2007  135031164.0  Africa
105        1271                   Reunion  2007     798094.0  Africa
107        1295                    Rwanda  2007    8860588.0  Africa
108        1307     Sao Tome and Principe  2007     199579.0  Africa
110        1331                   Senegal  2007   12267493.0  Africa
112        1355              Sierra Leone  2007    6144562.0  Africa
116        1403                   Somalia  2007    9118773.0  Africa
117        1415              South Africa  2007   43997828.0  Africa
120        1451                     Sudan  2007   42292929.0  Africa
121        1463                 Swaziland  2007    1133066.0  Africa
126        1523                  Tanzania  2007   38139640.0  Africa
128        1547                      Togo  2007    5701579.0  Africa
130        1571                   Tunisia  2007   10276158.0  Africa
132        1595                    Uganda  2007   29170398.0  Africa
140        1691                    Zambia  2007   11746035.0  Africa
141        1703                  Zimbabwe  2007   12311143.0  Africa

     life_exp       gdp_cap
2      72.301   6223.367465
3      42.731   4797.231267
10     56.728   1441.284873
13     50.728  12569.851770
16     52.295   1217.032994
17     49.580    430.070692
19     50.430   2042.095240
21     44.741    706.016537
22     50.651   1704.063724
26     65.152    986.147879
27     46.462    277.551859
28     55.322   3632.557798
30     48.328   1544.750112
35     54.791   2082.481567
38     71.338   5581.180998
40     51.579  12154.089750
41     58.040    641.369524
42     52.947    690.805576
45     56.735  13206.484520
46     59.448    752.749726
48     60.022   1327.608910
51     56.007    942.654211
52     46.388    579.231743
68     54.110   1463.249282
73     42.592   1569.331442
74     45.678    414.507341
75     73.952  12057.499280
76     59.443   1044.770126
77     48.303    759.349910
79     54.467   1042.581557
80     64.164   1803.151496
81     72.801  10956.991120
85     71.164   3820.175230
86     42.082    823.685621
88     52.906   4811.060429
93     56.867    619.676892
94     46.859   2013.977305
105    76.442   7670.122558
107    46.242    863.088464
108    65.528   1598.435089
110    63.062   1712.472136
112    42.568    862.540756
116    48.159    926.141068
117    49.339   9269.657808
120    58.556   2602.394995
121    39.613   4513.480643
126    52.517   1107.482182
128    58.420    882.969944
130    73.923   7092.923025
132    51.542   1056.380121
140    42.384   1271.211593
141    43.487    469.709298  )
('Americas',      Unnamed: 0              country  year   population      cont  life_exp
4            59            Argentina  2007   40301927.0  Americas    75.320  \
11          143              Bolivia  2007    9119152.0  Americas    65.554
14          179               Brazil  2007  190010647.0  Americas    72.390
20          251               Canada  2007   33390141.0  Americas    80.653
23          287                Chile  2007   16284741.0  Americas    78.553
25          311             Colombia  2007   44227550.0  Americas    72.889
29          359           Costa Rica  2007    4133884.0  Americas    78.782
32          395                 Cuba  2007   11416987.0  Americas    78.273
36          443   Dominican Republic  2007    9319622.0  Americas    72.235
37          455              Ecuador  2007   13755680.0  Americas    74.994
39          479          El Salvador  2007    6939688.0  Americas    71.878
50          611            Guatemala  2007   12572928.0  Americas    70.259
53          647                Haiti  2007    8502814.0  Americas    60.916
54          659             Honduras  2007    7483763.0  Americas    70.198
65          791              Jamaica  2007    2780132.0  Americas    72.567
82          995               Mexico  2007  108700891.0  Americas    76.195
92         1115            Nicaragua  2007    5675356.0  Americas    72.899
98         1187               Panama  2007    3242173.0  Americas    75.537
99         1199             Paraguay  2007    6667147.0  Americas    71.752
100        1211                 Peru  2007   28674757.0  Americas    71.421
104        1259          Puerto Rico  2007    3942491.0  Americas    78.746
129        1559  Trinidad and Tobago  2007    1056608.0  Americas    69.819
134        1619        United States  2007  301139947.0  Americas    78.242
135        1631              Uruguay  2007    3447496.0  Americas    76.384
136        1643            Venezuela  2007   26084662.0  Americas    73.747

          gdp_cap
4    12779.379640
11    3822.137084
14    9065.800825
20   36319.235010
23   13171.638850
25    7006.580419
29    9645.061420
32    8948.102923
36    6025.374752
37    6873.262326
39    5728.353514
50    5186.050003
53    1201.637154
54    3548.330846
65    7320.880262
82   11977.574960
92    2749.320965
98    9809.185636
99    4172.838464
100   7408.905561
104  19328.709010
129  18008.509240
134  42951.653090
135  10611.462990
136  11415.805690  )
('Asia',      Unnamed: 0             country  year    population  cont  life_exp
0            11         Afghanistan  2007  3.188992e+07  Asia    43.828  \
7            95             Bahrain  2007  7.085730e+05  Asia    75.635
8           107          Bangladesh  2007  1.504483e+08  Asia    64.062
18          227            Cambodia  2007  1.413186e+07  Asia    59.723
24          299               China  2007  1.318683e+09  Asia    72.961
55          671    Hong Kong, China  2007  6.980412e+06  Asia    82.208
58          707               India  2007  1.110396e+09  Asia    64.698
59          719           Indonesia  2007  2.235470e+08  Asia    70.650
60          731                Iran  2007  6.945357e+07  Asia    70.964
61          743                Iraq  2007  2.749964e+07  Asia    59.545
63          767              Israel  2007  6.426679e+06  Asia    80.745
66          803               Japan  2007  1.274680e+08  Asia    82.603
67          815              Jordan  2007  6.053193e+06  Asia    72.535
69          839    Korea, Dem. Rep.  2007  2.330172e+07  Asia    67.297
70          851         Korea, Rep.  2007  4.904479e+07  Asia    78.623
71          863              Kuwait  2007  2.505559e+06  Asia    77.588
72          875             Lebanon  2007  3.921278e+06  Asia    71.993
78          947            Malaysia  2007  2.482129e+07  Asia    74.241
83         1007            Mongolia  2007  2.874127e+06  Asia    66.803
87         1055             Myanmar  2007  4.776198e+07  Asia    62.069
89         1079               Nepal  2007  2.890179e+07  Asia    63.785
96         1163                Oman  2007  3.204897e+06  Asia    75.640
97         1175            Pakistan  2007  1.692706e+08  Asia    65.483
101        1223         Philippines  2007  9.107729e+07  Asia    71.688
109        1319        Saudi Arabia  2007  2.760104e+07  Asia    72.777
113        1367           Singapore  2007  4.553009e+06  Asia    79.972
119        1439           Sri Lanka  2007  2.037824e+07  Asia    72.396
124        1499               Syria  2007  1.931475e+07  Asia    74.143
125        1511              Taiwan  2007  2.317429e+07  Asia    78.400
127        1535            Thailand  2007  6.506815e+07  Asia    70.616
137        1655             Vietnam  2007  8.526236e+07  Asia    74.249
138        1667  West Bank and Gaza  2007  4.018332e+06  Asia    73.422
139        1679         Yemen, Rep.  2007  2.221174e+07  Asia    62.698

          gdp_cap
0      974.580338
7    29796.048340
8     1391.253792
18    1713.778686
24    4959.114854
55   39724.978670
58    2452.210407
59    3540.651564
60   11605.714490
61    4471.061906
63   25523.277100
66   31656.068060
67    4519.461171
69    1593.065480
70   23348.139730
71   47306.989780
72   10461.058680
78   12451.655800
83    3095.772271
87     944.000000
89    1091.359778
96   22316.192870
97    2605.947580
101   3190.481016
109  21654.831940
113  47143.179640
119   3970.095407
124   4184.548089
125  28718.276840
127   7458.396327
137   2441.576404
138   3025.349798
139   2280.769906  )
('Europe',      Unnamed: 0                 country  year  population    cont  life_exp
1            23                 Albania  2007   3600523.0  Europe    76.423  \
6            83                 Austria  2007   8199783.0  Europe    79.829
9           119                 Belgium  2007  10392226.0  Europe    79.441
12          155  Bosnia and Herzegovina  2007   4552198.0  Europe    74.852
15          191                Bulgaria  2007   7322858.0  Europe    73.005
31          383                 Croatia  2007   4493312.0  Europe    75.748
33          407          Czech Republic  2007  10228744.0  Europe    76.486
34          419                 Denmark  2007   5468120.0  Europe    78.332
43          527                 Finland  2007   5238460.0  Europe    79.313
44          539                  France  2007  61083916.0  Europe    80.657
47          575                 Germany  2007  82400996.0  Europe    79.406
49          599                  Greece  2007  10706290.0  Europe    79.483
56          683                 Hungary  2007   9956108.0  Europe    73.338
57          695                 Iceland  2007    301931.0  Europe    81.757
62          755                 Ireland  2007   4109086.0  Europe    78.885
64          779                   Italy  2007  58147733.0  Europe    80.546
84         1019              Montenegro  2007    684736.0  Europe    74.543
90         1091             Netherlands  2007  16570613.0  Europe    79.762
95         1151                  Norway  2007   4627926.0  Europe    80.196
102        1235                  Poland  2007  38518241.0  Europe    75.563
103        1247                Portugal  2007  10642836.0  Europe    78.098
106        1283                 Romania  2007  22276056.0  Europe    72.476
111        1343                  Serbia  2007  10150265.0  Europe    74.002
114        1379         Slovak Republic  2007   5447502.0  Europe    74.663
115        1391                Slovenia  2007   2009245.0  Europe    77.926
118        1427                   Spain  2007  40448191.0  Europe    80.941
122        1475                  Sweden  2007   9031088.0  Europe    80.884
123        1487             Switzerland  2007   7554661.0  Europe    81.701
131        1583                  Turkey  2007  71158647.0  Europe    71.777
133        1607          United Kingdom  2007  60776238.0  Europe    79.425

          gdp_cap
1     5937.029526
6    36126.492700
9    33692.605080
12    7446.298803
15   10680.792820
31   14619.222720
33   22833.308510
34   35278.418740
43   33207.084400
44   30470.016700
47   32170.374420
49   27538.411880
56   18008.944440
57   36180.789190
62   40675.996350
64   28569.719700
84    9253.896111
90   36797.933320
95   49357.190170
102  15389.924680
103  20509.647770
106  10808.475610
111   9786.534714
114  18678.314350
115  25768.257590
118  28821.063700
122  33859.748350
123  37506.419070
131   8458.276384
133  33203.261280  )
('Oceania',     Unnamed: 0      country  year  population     cont  life_exp      gdp_cap
5           71    Australia  2007  20434176.0  Oceania    81.235  34435.36744
91        1103  New Zealand  2007   4115771.0  Oceania    80.204  25185.00911)

In [101]:
# returns the mean of all the columns for each continent
df_cont_wise['life_exp'].mean()

cont
Africa      54.806038
Americas    73.608120
Asia        70.728485
Europe      77.648600
Oceania     80.719500
Name: life_exp, dtype: float64

In [113]:


df_cont_wise[['life_exp','gdp_cap','population']].mean()

,Unnamed: 0,country,year,population,cont,life_exp,gdp_cap
121,1463,Swaziland,2007,1133066.0,Africa,39.613,4513.480643
86,1043,Mozambique,2007,19951656.0,Africa,42.082,823.685621
140,1691,Zambia,2007,11746035.0,Africa,42.384,1271.211593
112,1355,Sierra Leone,2007,6144562.0,Africa,42.568,862.540756
73,887,Lesotho,2007,2012649.0,Africa,42.592,1569.331442
...,...,...,...,...,...,...,...
5,71,Australia,2007,20434176.0,Oceania,81.235,34435.367440
123,1487,Switzerland,2007,7554661.0,Europe,81.701,37506.419070
57,695,Iceland,2007,301931.0,Europe,81.757,36180.789190
55,671,"Hong Kong, China",2007,6980412.0,Asia,82.208,39724.978670
66,803,Japan,2007,127467972.0,Asia,82.603,31656.068060

In [ ]:
# AGGREGATION METHODS AGG()

In [112]:
df_cont_wise.agg({'life_exp':['mean','median','std','min','max','sum'], 'population':['mean','min','max','sum']})

           life_exp
               mean   median       std     min     max       sum
cont
Africa    54.806038  52.9265  9.630781  39.613  76.442  2849.914  \
Americas  73.608120  72.8990  4.440948  60.916  80.653  1840.203
Asia      70.728485  72.3960  7.963724  43.828  82.603  2334.040
Europe    77.648600  78.6085  2.979813  71.777  81.757  2329.458
Oceania   80.719500  80.7195  0.729027  80.204  81.235   161.439

            population
                  mean        min           max           sum
cont
Africa    1.787576e+07   199579.0  1.350312e+08  9.295397e+08
Americas  3.595485e+07  1056608.0  3.011399e+08  8.988712e+08
Asia      1.155138e+08   708573.0  1.318683e+09  3.811954e+09
Europe    1.953662e+07   301931.0  8.240100e+07  5.860985e+08
Oceania   1.227497e+07  4115771.0  2.043418e+07  2.454995e+07

In [106]:
df_cont_wise.agg('population').sum()

cont
Africa      9.295397e+08
Americas    8.988712e+08
Asia        3.811954e+09
Europe      5.860985e+08
Oceania     2.454995e+07
Name: population, dtype: float64

In [114]:
# Sorting values
df.sort_values(by='life_exp', ascending=True)

,Unnamed: 0,country,year,population,cont,life_exp,gdp_cap
121,1463,Swaziland,2007,1133066.0,Africa,39.613,4513.480643
86,1043,Mozambique,2007,19951656.0,Africa,42.082,823.685621
140,1691,Zambia,2007,11746035.0,Africa,42.384,1271.211593
112,1355,Sierra Leone,2007,6144562.0,Africa,42.568,862.540756
73,887,Lesotho,2007,2012649.0,Africa,42.592,1569.331442
...,...,...,...,...,...,...,...
5,71,Australia,2007,20434176.0,Oceania,81.235,34435.367440
123,1487,Switzerland,2007,7554661.0,Europe,81.701,37506.419070
57,695,Iceland,2007,301931.0,Europe,81.757,36180.789190
55,671,"Hong Kong, China",2007,6980412.0,Asia,82.208,39724.978670
66,803,Japan,2007,127467972.0,Asia,82.603,31656.068060

In [116]:
# sort values by 2 columns
df.sort_values(by=['cont', 'population'], ascending=[True, False])

,Unnamed: 0,country,year,population,cont,life_exp,gdp_cap
94,1139,Nigeria,2007,135031164.0,Africa,46.859,2013.977305
38,467,Egypt,2007,80264543.0,Africa,71.338,5581.180998
42,515,Ethiopia,2007,76511887.0,Africa,52.947,690.805576
27,335,"Congo, Dem. Rep.",2007,64606759.0,Africa,46.462,277.551859
117,1415,South Africa,2007,43997828.0,Africa,49.339,9269.657808
...,...,...,...,...,...,...,...
115,1391,Slovenia,2007,2009245.0,Europe,77.926,25768.257590
84,1019,Montenegro,2007,684736.0,Europe,74.543,9253.896111
57,695,Iceland,2007,301931.0,Europe,81.757,36180.789190
5,71,Australia,2007,20434176.0,Oceania,81.235,34435.367440
91,1103,New Zealand,2007,4115771.0,Oceania,80.204,25185.009110